"""
@author: Vladislav Kishkin
"""
import matplotlib.pyplot as plt

n = 10000                 # Кол-во точек
T = 180                   # Время
h = T / n                 # Шаг
g = 1 / 21                # Скорость выздоровления
b = 3 * g                 # Скорость передачи инфекции
r = b - g                 # Разница скоростей (передача - выздоровления)
N = 144 * 10 ** 3 * 0.01  # Кол-во людей в популяции
K = r * N / b             # Процент заболеваемости

susc = [0] * n            # Восприимчивые
t = [0] * n               # Временные промежутки (для графика)
infec = [0] * n           # Инфицированнные
infec[0] = 1              # Один инфицированный

for i in range(0, n - 1):
    tmp = r * infec[i] * (1 - infec[i] / K)  # Временная переменная, чтобы ее дважды не считать
    infec[i + 1] = infec[i] + tmp * h        # Подсчет кол-ва инфецированных на следующем шаге
    susc[i + 1] = tmp * 10                   # Подсчет кол-ва восприимчивых на следующем шаге

    t[i + 1] = t[i] + h                      # Подсчет времени

plt.title('Логическая кривая')
plt.xlabel('t')
plt.ylabel('infec, susc, тыс.ч.')

plt.plot(t, infec)
plt.plot(t, susc)
plt.show()



