""" Лабораторная работа №1 (весна) - ступень 3
РЕШЕНИЕ ЗАДАЧИ ДИРИХЛЕ ДЛЯ УРАВНЕНИЯ ПУАССОНА
(итерационный метод и его реализация в нестандартной области)

{  Δu(x, y) = –f*(x, y)     , при (x, y)∈G, G⊂[a, b]⊗[c, d]
{  u(x, y) = μ*(x, y)       , при (x, y)∈dG

Вариант задания:
  №  |  a, b, c, d   |      u*(x, y)        |
---------------------------------------------
  3  | -1, 1, -1, 1  |  exp(1 - x^2 - y^2)  |

Метод:
Метод минимальных невязок (ММН)

Область:
▧▧▧▧▧▧▧▧▧▧▧▧▧▧
▧▧▧▧▧▧▧▧▧▧▧▧▧▧
▧▧      ▧▧▧▧
▧▧      ▧▧▧▧
▧▧      ▧▧▧▧
▧▧▧▧▧▧▧▧▧▧▧▧▧▧
▧▧▧▧▧▧▧▧▧▧▧▧▧▧
"""


import os
from prettytable import PrettyTable


# Чистим экран (консоль) для разных ОС
def _cls() -> None:
    os.system('cls' if os.name == 'nt' else 'clear')


def main():
    pass


if __name__ == '__main__':
    a, b, c, d = -1, 1, -1, 1

    """ ----------------------------------------------Ввод параметров----------------------------------------------"""
    while True:
        try:
            n = int(input('Введите число разбиений по x, n='))
            if n <= 0:
                _cls()
                print('Нужно ввести целое положительное число. Попробуйте снова')
                continue
            break
        except ValueError:
            _cls()
            print('Вы ввели не число. Попробуйте снова')
    h = (b - a) / n

    while True:
        try:
            m = int(input('Введите число разбиений по y, m='))
            if m <= 0:
                _cls()
                print('Нужно ввести целое положительное число. Попробуйте снова')
                continue
            break
        except ValueError:
            _cls()
            print('Вы ввели не число. Попробуйте снова')
    k = (d - c) / m

    """ ----------------------------------------------/Ввод параметров----------------------------------------------"""

    """ -----------------------------------------Вывод начальной информации-----------------------------------------"""

    content = f"""Начальные условия и параметры:
    a; b; c; d = {a}; {b}; {c}; {d}
    Число разбиений по x, n = {n}; Шаг по x, h = {h}
    Число разбиений по y, m = {m}; Шаг по y, k = {k}
    """
    print(content)

    """ ----------------------------------------/Вывод начальной информации----------------------------------------"""

    main()
